{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_7"}}, {"class_name": "Functional", "config": {"name": "MobilenetV3large", "trainable": false, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_6"}, "registered_name": null, "name": "input_6", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Rescaling", "config": {"name": "rescaling_3", "trainable": false, "dtype": "float32", "scale": 0.00784313725490196, "offset": -1.0}, "registered_name": null, "build_config": {"input_shape": [null, 224, 224, 3]}, "name": "rescaling_3", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "Conv", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 224, 224, 3]}, "name": "Conv", "inbound_nodes": [[["rescaling_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "Conv/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 16]}, "name": "Conv/BatchNorm", "inbound_nodes": [[["Conv", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_84", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 112, 112, 16]}, "name": "tf.__operators__.add_84", "inbound_nodes": [["Conv/BatchNorm", 0, 0, {"y": 3.0, "name": null}]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_117", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 16]}, "name": "re_lu_117", "inbound_nodes": [[["tf.__operators__.add_84", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_84", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 112, 112, 16]}, "name": "tf.math.multiply_84", "inbound_nodes": [["re_lu_117", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "multiply_60", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 112, 112, 16], [null, 112, 112, 16]]}, "name": "multiply_60", "inbound_nodes": [[["Conv/BatchNorm", 0, 0, {}], ["tf.math.multiply_84", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv/depthwise", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 16]}, "name": "expanded_conv/depthwise", "inbound_nodes": [[["multiply_60", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "expanded_conv/depthwise/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 16]}, "name": "expanded_conv/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv/depthwise", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_118", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 16]}, "name": "re_lu_118", "inbound_nodes": [[["expanded_conv/depthwise/BatchNorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "expanded_conv/project", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 16]}, "name": "expanded_conv/project", "inbound_nodes": [[["re_lu_118", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "expanded_conv/project/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 16]}, "name": "expanded_conv/project/BatchNorm", "inbound_nodes": [[["expanded_conv/project", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "expanded_conv/Add", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 112, 112, 16], [null, 112, 112, 16]]}, "name": "expanded_conv/Add", "inbound_nodes": [[["multiply_60", 0, 0, {}], ["expanded_conv/project/BatchNorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "expanded_conv_1/expand", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 16]}, "name": "expanded_conv_1/expand", "inbound_nodes": [[["expanded_conv/Add", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_1/expand/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 64]}, "name": "expanded_conv_1/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_1/expand", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_119", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 64]}, "name": "re_lu_119", "inbound_nodes": [[["expanded_conv_1/expand/BatchNorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ZeroPadding2D", "config": {"name": "expanded_conv_1/depthwise/pad", "trainable": false, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 64]}, "name": "expanded_conv_1/depthwise/pad", "inbound_nodes": [[["re_lu_119", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_1/depthwise", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 113, 113, 64]}, "name": "expanded_conv_1/depthwise", "inbound_nodes": [[["expanded_conv_1/depthwise/pad", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_1/depthwise/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 64]}, "name": "expanded_conv_1/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_1/depthwise", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_120", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 64]}, "name": "re_lu_120", "inbound_nodes": [[["expanded_conv_1/depthwise/BatchNorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "expanded_conv_1/project", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 64]}, "name": "expanded_conv_1/project", "inbound_nodes": [[["re_lu_120", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_1/project/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 24]}, "name": "expanded_conv_1/project/BatchNorm", "inbound_nodes": [[["expanded_conv_1/project", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "expanded_conv_2/expand", "trainable": false, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 24]}, "name": "expanded_conv_2/expand", "inbound_nodes": [[["expanded_conv_1/project/BatchNorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_2/expand/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 72]}, "name": "expanded_conv_2/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_2/expand", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_121", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 72]}, "name": "re_lu_121", "inbound_nodes": [[["expanded_conv_2/expand/BatchNorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_2/depthwise", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 72]}, "name": "expanded_conv_2/depthwise", "inbound_nodes": [[["re_lu_121", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_2/depthwise/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 72]}, "name": "expanded_conv_2/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_2/depthwise", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_122", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 72]}, "name": "re_lu_122", "inbound_nodes": [[["expanded_conv_2/depthwise/BatchNorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "expanded_conv_2/project", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 72]}, "name": "expanded_conv_2/project", "inbound_nodes": [[["re_lu_122", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_2/project/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 24]}, "name": "expanded_conv_2/project/BatchNorm", "inbound_nodes": [[["expanded_conv_2/project", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "expanded_conv_2/Add", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 56, 56, 24], [null, 56, 56, 24]]}, "name": "expanded_conv_2/Add", "inbound_nodes": [[["expanded_conv_1/project/BatchNorm", 0, 0, {}], ["expanded_conv_2/project/BatchNorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "expanded_conv_3/expand", "trainable": false, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 24]}, "name": "expanded_conv_3/expand", "inbound_nodes": [[["expanded_conv_2/Add", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_3/expand/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 72]}, "name": "expanded_conv_3/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_3/expand", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_123", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 72]}, "name": "re_lu_123", "inbound_nodes": [[["expanded_conv_3/expand/BatchNorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ZeroPadding2D", "config": {"name": "expanded_conv_3/depthwise/pad", "trainable": false, "dtype": "float32", "padding": [[1, 2], [1, 2]], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 72]}, "name": "expanded_conv_3/depthwise/pad", "inbound_nodes": [[["re_lu_123", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_3/depthwise", "trainable": false, "dtype": "float32", "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 59, 59, 72]}, "name": "expanded_conv_3/depthwise", "inbound_nodes": [[["expanded_conv_3/depthwise/pad", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_3/depthwise/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 72]}, "name": "expanded_conv_3/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_3/depthwise", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_124", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 72]}, "name": "re_lu_124", "inbound_nodes": [[["expanded_conv_3/depthwise/BatchNorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_3/squeeze_excite/AvgPool", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 72]}, "name": "expanded_conv_3/squeeze_excite/AvgPool", "inbound_nodes": [[["re_lu_124", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "expanded_conv_3/squeeze_excite/Conv", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 72]}, "name": "expanded_conv_3/squeeze_excite/Conv", "inbound_nodes": [[["expanded_conv_3/squeeze_excite/AvgPool", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "expanded_conv_3/squeeze_excite/Relu", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 24]}, "name": "expanded_conv_3/squeeze_excite/Relu", "inbound_nodes": [[["expanded_conv_3/squeeze_excite/Conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "expanded_conv_3/squeeze_excite/Conv_1", "trainable": false, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 24]}, "name": "expanded_conv_3/squeeze_excite/Conv_1", "inbound_nodes": [[["expanded_conv_3/squeeze_excite/Relu", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_85", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 1, 1, 72]}, "name": "tf.__operators__.add_85", "inbound_nodes": [["expanded_conv_3/squeeze_excite/Conv_1", 0, 0, {"y": 3.0, "name": null}]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_125", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 72]}, "name": "re_lu_125", "inbound_nodes": [[["tf.__operators__.add_85", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_85", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 1, 1, 72]}, "name": "tf.math.multiply_85", "inbound_nodes": [["re_lu_125", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "expanded_conv_3/squeeze_excite/Mul", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 28, 28, 72], [null, 1, 1, 72]]}, "name": "expanded_conv_3/squeeze_excite/Mul", "inbound_nodes": [[["re_lu_124", 0, 0, {}], ["tf.math.multiply_85", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "expanded_conv_3/project", "trainable": false, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 72]}, "name": "expanded_conv_3/project", "inbound_nodes": [[["expanded_conv_3/squeeze_excite/Mul", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_3/project/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 40]}, "name": "expanded_conv_3/project/BatchNorm", "inbound_nodes": [[["expanded_conv_3/project", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "expanded_conv_4/expand", "trainable": false, "dtype": "float32", "filters": 120, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 40]}, "name": "expanded_conv_4/expand", "inbound_nodes": [[["expanded_conv_3/project/BatchNorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_4/expand/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 120]}, "name": "expanded_conv_4/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_4/expand", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_126", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 120]}, "name": "re_lu_126", "inbound_nodes": [[["expanded_conv_4/expand/BatchNorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_4/depthwise", "trainable": false, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 120]}, "name": "expanded_conv_4/depthwise", "inbound_nodes": [[["re_lu_126", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_4/depthwise/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 120]}, "name": "expanded_conv_4/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_4/depthwise", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_127", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 120]}, "name": "re_lu_127", "inbound_nodes": [[["expanded_conv_4/depthwise/BatchNorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_4/squeeze_excite/AvgPool", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 120]}, "name": "expanded_conv_4/squeeze_excite/AvgPool", "inbound_nodes": [[["re_lu_127", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "expanded_conv_4/squeeze_excite/Conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 120]}, "name": "expanded_conv_4/squeeze_excite/Conv", "inbound_nodes": [[["expanded_conv_4/squeeze_excite/AvgPool", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "expanded_conv_4/squeeze_excite/Relu", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 32]}, "name": "expanded_conv_4/squeeze_excite/Relu", "inbound_nodes": [[["expanded_conv_4/squeeze_excite/Conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "expanded_conv_4/squeeze_excite/Conv_1", "trainable": false, "dtype": "float32", "filters": 120, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 32]}, "name": "expanded_conv_4/squeeze_excite/Conv_1", "inbound_nodes": [[["expanded_conv_4/squeeze_excite/Relu", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_86", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 1, 1, 120]}, "name": "tf.__operators__.add_86", "inbound_nodes": [["expanded_conv_4/squeeze_excite/Conv_1", 0, 0, {"y": 3.0, "name": null}]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_128", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 120]}, "name": "re_lu_128", "inbound_nodes": [[["tf.__operators__.add_86", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_86", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 1, 1, 120]}, "name": "tf.math.multiply_86", "inbound_nodes": [["re_lu_128", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "expanded_conv_4/squeeze_excite/Mul", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 28, 28, 120], [null, 1, 1, 120]]}, "name": "expanded_conv_4/squeeze_excite/Mul", "inbound_nodes": [[["re_lu_127", 0, 0, {}], ["tf.math.multiply_86", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "expanded_conv_4/project", "trainable": false, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 120]}, "name": "expanded_conv_4/project", "inbound_nodes": [[["expanded_conv_4/squeeze_excite/Mul", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_4/project/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 40]}, "name": "expanded_conv_4/project/BatchNorm", "inbound_nodes": [[["expanded_conv_4/project", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "expanded_conv_4/Add", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 28, 28, 40], [null, 28, 28, 40]]}, "name": "expanded_conv_4/Add", "inbound_nodes": [[["expanded_conv_3/project/BatchNorm", 0, 0, {}], ["expanded_conv_4/project/BatchNorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "expanded_conv_5/expand", "trainable": false, "dtype": "float32", "filters": 120, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 40]}, "name": "expanded_conv_5/expand", "inbound_nodes": [[["expanded_conv_4/Add", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_5/expand/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 120]}, "name": "expanded_conv_5/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_5/expand", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_129", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 120]}, "name": "re_lu_129", "inbound_nodes": [[["expanded_conv_5/expand/BatchNorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_5/depthwise", "trainable": false, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 120]}, "name": "expanded_conv_5/depthwise", "inbound_nodes": [[["re_lu_129", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "expanded_conv_5/depthwise/BatchNorm", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 120]}, "name": "expanded_conv_5/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_5/depthwise", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_130", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 120]}, "name": "re_lu_130", "inbound_nodes": [[["expanded_conv_5/depthwise/BatchNorm", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_5/squeeze_excite/AvgPool", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": true}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 120]}, "name": "expanded_conv_5/squeeze_excite/AvgPool", "inbound_nodes": [[["re_lu_130", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "expanded_conv_5/squeeze_excite/Conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": 